Revit 2017 API
AssetProperty.NumberOfConnectedProperties Property
 The number of currently connected properties.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public int NumberOfConnectedProperties { get; }
Visual Basic
Public ReadOnly Property NumberOfConnectedProperties As Integer
	Get
Visual C++
public:
property int NumberOfConnectedProperties {
	int get ();
}
See Also
AssetProperty Class
Autodesk.Revit.Utility Namespace